In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
df=pd.read_csv("C:/Users/coeco/Downloads/Assign_3_Mall_Customers (1).csv")

In [5]:
df1=df
df2=df1
df3=df
df4=df

In [6]:
df

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
0,1,Male,Teen,19,15,39
1,2,Male,Middle Age,21,15,81
2,3,Female,Middle Age,20,16,6
3,4,Female,Middle Age,23,16,77
4,5,Female,Middle Age,31,17,40
...,...,...,...,...,...,...
195,196,Female,Middle Age,35,120,79
196,197,Female,Elder,45,126,28
197,198,Male,Middle Age,32,126,74
198,199,Male,Middle Age,32,137,18
199,200,Male,Middle Age,30,137,83

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age Group               200 non-null    object
 3   Age                     200 non-null    int64
 4   Annual Income (k$)      200 non-null    int64
 5   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(2)
memory usage: 9.5+ KB

In [8]:
df.shape

(200, 6)

In [9]:
df.head()

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
0,1,Male,Teen,19,15,39
1,2,Male,Middle Age,21,15,81
2,3,Female,Middle Age,20,16,6
3,4,Female,Middle Age,23,16,77
4,5,Female,Middle Age,31,17,40

In [10]:
df.tail()

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
195,196,Female,Middle Age,35,120,79
196,197,Female,Elder,45,126,28
197,198,Male,Middle Age,32,126,74
198,199,Male,Middle Age,32,137,18
199,200,Male,Middle Age,30,137,83

In [11]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [12]:
import pandas as pd
import numpy as np
import requests
df=pd.read_csv("C:/Users/coeco/Downloads/Assign_3_Mall_Customers (1).csv")

In [13]:
df[['CustomerID','Annual Income (k$)']].mean()

CustomerID            100.50
Annual Income (k$)     60.56
dtype: float64

In [14]:
df[['CustomerID','Age Group','Age','Annual Income (k$)','Spending Score (1-100)']].min()

CustomerID                    1
Age Group                 Elder
Age                          18
Annual Income (k$)           15
Spending Score (1-100)        1
dtype: object

In [15]:
df[['CustomerID','Spending Score (1-100)']].median()

CustomerID                100.5
Spending Score (1-100)     50.0
dtype: float64

In [16]:
df[['CustomerID','Age Group','Age','Annual Income (k$)','Spending Score (1-100)']].max()

CustomerID                 200
Age Group                 Teen
Age                         70
Annual Income (k$)         137
Spending Score (1-100)      99
dtype: object

In [17]:
df[['Annual Income (k$)','Spending Score (1-100)']].std()

Annual Income (k$)        26.264721
Spending Score (1-100)    25.823522
dtype: float64

In [18]:
df2=df.groupby('Genre')

In [19]:
df2

In [20]:
for Gender,Gender_f in df2:
    print(Gender)
    print(Gender_f)

Female
     CustomerID   Genre   Age Group  Age  Annual Income (k$)  \
2             3  Female  Middle Age   20                  16
3             4  Female  Middle Age   23                  16
4             5  Female  Middle Age   31                  17
5             6  Female  Middle Age   22                  17
6             7  Female  Middle Age   35                  18
..          ...     ...         ...  ...                 ...
191         192  Female  Middle Age   32                 103
193         194  Female  Middle Age   38                 113
194         195  Female       Elder   47                 120
195         196  Female  Middle Age   35                 120
196         197  Female       Elder   45                 126

     Spending Score (1-100)
2                         6
3                        77
4                        40
5                        76
6                         6
..                      ...
191                      69
193                      91
194                      16
195                      79
196                      28

[112 rows x 6 columns]
Male
     CustomerID Genre   Age Group  Age  Annual Income (k$)  \
0             1  Male        Teen   19                  15
1             2  Male  Middle Age   21                  15
8             9  Male       Elder   64                  19
10           11  Male       Elder   67                  19
14           15  Male  Middle Age   37                  20
..          ...   ...         ...  ...                 ...
187         188  Male  Middle Age   28                 101
192         193  Male  Middle Age   33                 113
197         198  Male  Middle Age   32                 126
198         199  Male  Middle Age   32                 137
199         200  Male  Middle Age   30                 137

     Spending Score (1-100)
0                        39
1                        81
8                         3
10                       14
14                       13
..                      ...
187                      68
192                       8
197                      74
198                      18
199                      83

[88 rows x 6 columns]

In [21]:
df2.get_group('Female')

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
2,3,Female,Middle Age,20,16,6
3,4,Female,Middle Age,23,16,77
4,5,Female,Middle Age,31,17,40
5,6,Female,Middle Age,22,17,76
6,7,Female,Middle Age,35,18,6
...,...,...,...,...,...,...
191,192,Female,Middle Age,32,103,69
193,194,Female,Middle Age,38,113,91
194,195,Female,Elder,47,120,16
195,196,Female,Middle Age,35,120,79
196,197,Female,Elder,45,126,28

In [22]:
df2.get_group('Male')

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
0,1,Male,Teen,19,15,39
1,2,Male,Middle Age,21,15,81
8,9,Male,Elder,64,19,3
10,11,Male,Elder,67,19,14
14,15,Male,Middle Age,37,20,13
...,...,...,...,...,...,...
187,188,Male,Middle Age,28,101,68
192,193,Male,Middle Age,33,113,8
197,198,Male,Middle Age,32,126,74
198,199,Male,Middle Age,32,137,18
199,200,Male,Middle Age,30,137,83

In [23]:
df2[['CustomerID','Genre','Age Group','Age','Annual Income (k$)','Spending Score (1-100)']].max()

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
Genre,,,,,,
Female,197,Female,Teen,68,126,99
Male,200,Male,Teen,70,137,97

In [24]:
df2[['CustomerID','Genre','Age Group','Age','Annual Income (k$)','Spending Score (1-100)']].min()

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
Genre,,,,,,
Female,3,Female,Elder,18,16,5
Male,1,Male,Elder,18,15,1

In [25]:
df2[['CustomerID','Genre','Age Group','Age','Annual Income (k$)','Spending Score (1-100)']].mean()

        CustomerID        Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female   97.562500  38.098214           59.250000               51.526786
Male    104.238636  39.806818           62.227273               48.511364

In [26]:
df2[['CustomerID','Genre','Age Group','Age','Annual Income (k$)','Spending Score (1-100)']].std()

        CustomerID        Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female   58.276412  12.644095           26.011952                24.11495
Male     57.483830  15.514812           26.638373                27.89677

In [27]:
a=np.percentile(df3['Age'],50)

In [28]:
a

36.0

In [ ]:
b=np.percentile(df3['Age'],100)

In [ ]:
b

70.0

In [ ]:
a=np.percentile(df3['Annual Income (k$)'],50)

In [ ]:
a

61.5

In [ ]:
b=np.percentile(df3['Annual Income (k$)'],60)

In [ ]:
b

67.0

In [ ]:
a=np.percentile(df3['CustomerID'],50)

In [ ]:
a

100.5

In [ ]:
a=np.percentile(df3['CustomerID'],80)

In [ ]:
a

160.20000000000002

In [ ]:
a=np.percentile(df3['Spending Score (1-100)'],50)

In [ ]:
a

50.0

In [ ]:
a=np.percentile(df3['Spending Score (1-100)'],40)

In [ ]:
a

45.60000000000001